Tekla Open API Reference for Tekla Structures 2025
ControlCircle Constructor
Overload List
Name | Description
ControlCircle()
 Initializes a new instance of the ControlCircle class.
 The default values are as follows:
 Color = ControlCircleColorEnum.YELLOW;
 Extension = 0.0;
ControlCircle(Point, Point, Point)
 Initializes a new instance of the ControlCircle class. The control circle is not magnetic.
Top
See Also
Reference
ControlCircle Class
Tekla.Structures.Model Namespace